{
  "title": "elizaos Eliza (2025-01-07)",
  "version": "",
  "overview": "Development focused on package improvements (adding tests for twitter plugin), new features (support for eternalai provider can write request/response log info), 6 bug fixes. with 46 contributors merging 20 PRs. Major work included various improvements.",
  "metrics": {
    "contributors": 46,
    "merged_prs": 20,
    "new_issues": 24,
    "lines_changed": 2052
  },
  "changes": {
    "features": [
      "support for eternalai provider can write request/response log info",
      "support for eternalai provider can make request with chain_id extra data in body",
      "Add fraxtal chain to evm"
    ],
    "fixes": [
      "many fixes to the Telegram templates",
      "SQLITE ERROR, zero-lenght vectors not supported",
      "fixed error in C3PO and improved error handling feedback"
    ],
    "chores": [
      "Enable all EVM chains by default",
      "add embedding tests",
      "Cleaner logs on agent startup"
    ]
  },
  "areas": [
    {
      "name": "packages",
      "files": 71,
      "additions": 1411,
      "deletions": 498
    },
    {
      "name": "root",
      "files": 20,
      "additions": 20,
      "deletions": 28
    },
    {
      "name": "docs",
      "files": 15,
      "additions": 18,
      "deletions": 20
    }
  ],
  "issues_summary": "working on 20 bugs including 'Tests for core package are failling on develop branch, due they are outdated', 'fix: context for client-telegram' and implementing 3 feature requests including 'Debugging documentation out of date', 'support default grok in generate object for twitter plugin'",
  "questions": [],
  "top_contributors": [
    {
      "name": "ai16z-demirix",
      "summary": "ai16z-demirix is currently working on adding and updating tests for the core package related to the Twitter functionality",
      "areas": [
        "packages"
      ]
    },
    {
      "name": "genesis-0000",
      "summary": "genesis-0000 is currently working on adding support for the eternalai provider in their project, allowing for request/response log information to be written and for requests to be made with chain_id extra data in the body",
      "areas": [
        "packages",
        ".env.example"
      ]
    },
    {
      "name": "Laurentiu-Andronache",
      "summary": "Laurentiu-Andronache is currently working on adding debug logging for context, fixing context issues for the client-telegram, and making various fixes to the Telegram templates",
      "areas": [
        "packages"
      ]
    }
  ]
}