{
  "title": "elizaos Eliza (2025-01-12)",
  "version": "",
  "overview": "Development focused on package improvements (change prompt to ensure it returns json), new features (nft plugin), 6 bug fixes. with 38 contributors merging 22 PRs. Major work included odilitime is actively working on merging pull requests, fixing json format issues, bumping versions, and making code changes in various areas such as agent, client, characters, and documentation within the project repository.",
  "metrics": {
    "contributors": 38,
    "merged_prs": 22,
    "new_issues": 19,
    "lines_changed": 29922
  },
  "changes": {
    "features": [
      "nft plugin",
      "adding tests for whatsapp plugin",
      "🎈 perf(vscode): Set file nesting for md and DockerFile"
    ],
    "fixes": [
      "change prompt to ensure it returns json",
      "release 0.1.8 fixes",
      "Missing LETZAI model"
    ],
    "chores": [
      "0.1.8.build.1 (dev => main)",
      "Prep 0.1.8.build.1",
      "lint and fix pass on develop"
    ]
  },
  "areas": [
    {
      "name": "packages",
      "files": 321,
      "additions": 9170,
      "deletions": 622
    },
    {
      "name": "client",
      "files": 59,
      "additions": 14758,
      "deletions": 503
    },
    {
      "name": "root",
      "files": 41,
      "additions": 2438,
      "deletions": 1017
    }
  ],
  "issues_summary": "working on 7 bugs including 'Together ai medium model invalid', 'SttTtsPlugin error when launching space' and implementing 9 feature requests including 'Add tests for WhatsApp plugin', 'Coinbase-plugin - add tests acorrding to follow package structure'",
  "questions": [],
  "top_contributors": [
    {
      "name": "odilitime",
      "summary": "odilitime is actively working on merging pull requests, fixing JSON format issues, bumping versions, and making code changes in various areas such as agent, client, characters, and documentation within the project repository",
      "areas": [
        "README_RS.md",
        "lerna.json",
        "README_TG.md"
      ]
    },
    {
      "name": "tcm390",
      "summary": "tcm390 is currently working on adding support for deepseek, updating README in Greek language, adding a new nft plugin, and making corrections to parameters and return values in the codebase",
      "areas": [
        ".gitignore",
        "package.json",
        "packages"
      ]
    },
    {
      "name": "ai16z-demirix",
      "summary": "ai16z-demirix is currently working on adding tests for various plugins, such as the Coinbase and WhatsApp plugins, to enhance the packages in the codebase",
      "areas": [
        "packages"
      ]
    }
  ]
}